        // for

// initialize:ციკლი დაწყებამდე  ცვლადის ანიციალიზაცია(ხშირად ,საწყისი მნიშვნელობა)

// condition: პირობა,რომელიც უნდა შეამოწმოს თითოეულ ციკლში.თუ ეს პირობა ჭეშმარიტია,ციკლი გაგრძელდება.

// increment: თითოეული ციკლის დასრულება შემდეგ,ცვლადის განახლება.

for (let i = 0; i < 5; i++) {
    console.log("i-ის მნიშვნელობაა: ", i);
}

// ამ შემთხვევაში, i იწყება 0-დან და სანამ მისი მნიშვნელობა 5-ზე ნაკლებია,ციკლი იმუშავებს და თითოეულ განმეორების შემდეგ, i ერთით გაიზრდება. console.log() ყოველ განმეორებისას დაბეჭდავს i-ს მიმდინარე მნიშვნელობას:
// i-ის მნიშვნელობაა:  0
// i-ის მნიშვნელობაა:  1
// i-ის მნიშვნელობაა:  2
// i-ის მნიშვნელობაა:  3
// i-ის მნიშვნელობაა:  4


        // while


// ციკლი იმუშავებს მანამ,სანამ პირობა ჭეშმარიტია.

let count = 0;
while (count < 3) {
    console.log("count-ის მნიშვნელობაა: ", count);
    count++; // თითოეული ციკლის შემდეგ count-ის გაზრდა
}

// ამ შემთხვევაში, ციკლი იმუშავებს მანამ,სანამ count იქნება 3-ზე ნაკლები. ყოველ განმეორებაზე count ერთით იზრდება და console.log() გამოყოფს მის მნიშვნელობას.


        //do...while ციკლი
        
let x = 5;

do{
    console.log("x-ის მნიშვნელობაა:" , x);
    x ++;
} while (x < 5);


        //break: ციკლის შეწყვეტა
        
for (let i = 0; i < 10; i++){
    if (i === 5){
        break; // გაჩერება, როცა i გახდება 5
    }
    console.log("i =", i);
}


        //continue: განმეორების გამოტოვება
        
for (let i = 0; i <10; i++){
    if (i % 2 === 0){
        continue; // თუ i ლუწია, გამოტოვებ მას
    }
    console.log("i =", i);
}


        // მასივებთან მუშაობა ციკლებით
        
let fruits = ["ვაშლი", "ბანანი", "ატამი","მანგო"];

for (let i = 0; i < fruits.length; i++){
    console.log(fruits[i]);
}

// ამ კოდში , fruits.length გვაძლევს მასივის სიგრძეს(ელემტების რაოდენობას), ხოლო fruits[i] მიუთითებს მაისივის თითოეულ ელემეტზე მისი ინდექსის მიხედვით. შედეგად,ყველა ხილი ცალ-ცალკე  დაიბეჭდება:

// .ვაშლი
// .ბანანი
// .ატამი
// .მანგო
