        // for

// initialize:ციკლი დაწყებამდე  ცვლადის ანიციალიზაცია(ხშირად ,საწყისი მნიშვნელობა)

// condition: პირობა,რომელიც უნდა შეამოწმოს თითოეულ ციკლში.თუ ეს პირობა ჭეშმარიტია,ციკლი გაგრძელდება.

// increment: თითოეული ციკლის დასრულება შემდეგ,ცვლადის განახლება.

for (let i = 0; i < 5; i++) {
    console.log("i-ის მნიშვნელობაა: ", i);
}

// ამ შემთხვევაში, i იწყება 0-დან და სანამ მისი მნიშვნელობა 5-ზე ნაკლებია,ციკლი იმუშავებს და თითოეულ განმეორების შემდეგ, i ერთით გაიზრდება. console.log() ყოველ განმეორებისას დაბეჭდავს i-ს მიმდინარე მნიშვნელობას:
// i-ის მნიშვნელობაა:  0
// i-ის მნიშვნელობაა:  1
// i-ის მნიშვნელობაა:  2
// i-ის მნიშვნელობაა:  3
// i-ის მნიშვნელობაა:  4


        // while